labs/realistic/latency/reports/adaptive-bulkread-64k1m-20260528T224523Z/singbox-bw-fast-tcp-1m-ka-20260528T224711Z.hey.txt

Summary:
  Total:	30.0135 secs
  Slowest:	0.2523 secs
  Fastest:	0.0025 secs
  Average:	0.0209 secs
  Requests/sec:	1532.0433
  
  Total data:	48215621632 bytes
  Size/request:	1048576 bytes

Response time histogram:
  0.002 [1]	|
  0.027 [39948]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.052 [5982]	|■■■■■■
  0.077 [29]	|
  0.102 [1]	|
  0.127 [0]	|
  0.152 [0]	|
  0.177 [0]	|
  0.202 [0]	|
  0.227 [12]	|
  0.252 [9]	|


Latency distribution:
  10%% in 0.0136 secs
  25%% in 0.0165 secs
  50%% in 0.0202 secs
  75%% in 0.0243 secs
  90%% in 0.0287 secs
  95%% in 0.0319 secs
  99%% in 0.0391 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0138 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0098 secs
  resp wait:	0.0083 secs, 0.0008 secs, 0.0423 secs
  resp read:	0.0125 secs, 0.0002 secs, 0.2428 secs

Status code distribution:
  [200]	45982 responses