labs/realistic/latency/reports/adaptive-bulkread-64k1m-20260528T224523Z/singbox-bw-fast-tcp-64k-ka-20260528T224559Z.hey.txt

Summary:
  Total:	30.0018 secs
  Slowest:	0.0150 secs
  Fastest:	0.0004 secs
  Average:	0.0029 secs
  Requests/sec:	11073.4848
  
  Total data:	21772632064 bytes
  Size/request:	65536 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [34507]	|■■■■■■■
  0.003 [204098]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [83785]	|■■■■■■■■■■■■■■■■
  0.006 [8598]	|■■
  0.008 [1044]	|
  0.009 [139]	|
  0.011 [17]	|
  0.012 [11]	|
  0.014 [21]	|
  0.015 [3]	|


Latency distribution:
  10%% in 0.0018 secs
  25%% in 0.0023 secs
  50%% in 0.0028 secs
  75%% in 0.0034 secs
  90%% in 0.0040 secs
  95%% in 0.0044 secs
  99%% in 0.0055 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0066 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0050 secs
  resp wait:	0.0027 secs, 0.0002 secs, 0.0111 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0106 secs

Status code distribution:
  [200]	332224 responses