labs/realistic/latency/reports/adaptive-bulkread-64k1m-20260528T224523Z/singbox-singbox-tcp-1m-ka-20260528T224635Z.hey.txt

Summary:
  Total:	30.0102 secs
  Slowest:	0.2418 secs
  Fastest:	0.0038 secs
  Average:	0.0219 secs
  Requests/sec:	1458.1026
  
  Total data:	45883588608 bytes
  Size/request:	1048576 bytes

Response time histogram:
  0.004 [1]	|
  0.028 [36078]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.051 [7577]	|■■■■■■■■
  0.075 [82]	|
  0.099 [1]	|
  0.123 [0]	|
  0.147 [0]	|
  0.170 [0]	|
  0.194 [0]	|
  0.218 [3]	|
  0.242 [16]	|


Latency distribution:
  10%% in 0.0139 secs
  25%% in 0.0173 secs
  50%% in 0.0211 secs
  75%% in 0.0255 secs
  90%% in 0.0307 secs
  95%% in 0.0344 secs
  99%% in 0.0427 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0063 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0263 secs
  resp wait:	0.0091 secs, 0.0004 secs, 0.0514 secs
  resp read:	0.0128 secs, 0.0002 secs, 0.2280 secs

Status code distribution:
  [200]	43758 responses