labs/realistic/latency/reports/adaptive-bulkread-64k1m-20260528T224523Z/singbox-singbox-tcp-64k-ka-20260528T224523Z.hey.txt

Summary:
  Total:	30.0025 secs
  Slowest:	0.0155 secs
  Fastest:	0.0004 secs
  Average:	0.0030 secs
  Requests/sec:	10679.4081
  
  Total data:	20998324224 bytes
  Size/request:	65536 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [34510]	|■■■■■■■
  0.003 [191913]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [82928]	|■■■■■■■■■■■■■■■■■
  0.006 [9780]	|■■
  0.008 [1107]	|
  0.009 [124]	|
  0.011 [23]	|
  0.012 [5]	|
  0.014 [10]	|
  0.015 [8]	|


Latency distribution:
  10%% in 0.0019 secs
  25%% in 0.0024 secs
  50%% in 0.0029 secs
  75%% in 0.0035 secs
  90%% in 0.0042 secs
  95%% in 0.0047 secs
  99%% in 0.0058 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0069 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0036 secs
  resp wait:	0.0027 secs, 0.0002 secs, 0.0117 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0088 secs

Status code distribution:
  [200]	320409 responses